ERAU-EagleSat-PR/MDE/MDE_Payload_TM4C123GXL/MDE_Payload_TM4C123GXL.c
//*****************************************************************************
//
// The MDE payload prototype.
// Maybe we should have a license?
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "MDE_Payload_TM4C123GXL.h"
#include "Access_Tools.h"
#include "MB85RS2MTYPNF.h"
#include "MR25H40.h"
#include "IS62WVS5128GBLL.h"
#include "S25FL256LA.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_gpio.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/timer.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "driverlib/ssi.h"

//
// Initializing global variables
//

// Sequence variables, which control what is written to the chips
// It's best if the offset is prime
// If sequence value sets are changed, make sure to change the corresponding
// length #defines in the header file.
unsigned const char sequence_start_values[] = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
uint32_t current_sequence_start = 0;
unsigned const char sequence_offset_values[] = {7, 13, 17, 19, 23, 29, 31, 33};
uint32_t current_sequence_offset = 0;
unsigned short cycle_count = 0;

// The error buffer variables
uint64_t error_buffer[ERROR_BUFFER_MAX_SIZE];
uint32_t current_error = 0;
uint32_t old_current_error = 0;
// The unresponsiveness buffer
uint64_t chip_unresponsive;

// State trackers for the menu in debug mode
#ifdef DEBUG
enum MENU_STATES menu_state = INIT;
uint32_t selected_chip_number = 0;
#endif

// Variables for the timer
uint32_t timer_current_cycle = 0;
bool timer_wakeup = false;

// The current clock speed
uint32_t SysClkSpeed = 0;

//*****************************************************************************
//
// Transmit the current error buffer over UART.
//
//*****************************************************************************
void
TransmitErrors(){
  
#ifdef DEBUG
  
  char buf[100];
  
  sprintf(buf,"Printing errors. Current error count: %d.\n\r", current_error);
  UARTSend((uint8_t*) buf, strlen(buf));
  
  // Output if chips are unresponsive
  uint32_t unresponsive_iter;
  for(unresponsive_iter = 0; unresponsive_iter < TOTAL_CHIP_COUNT; unresponsive_iter++){
    if((chip_unresponsive >> unresponsive_iter) & 1 == 1){
      sprintf(buf, "Critical Error: Chip %i is unresponsive or wiped.\n\r", unresponsive_iter);
      UARTSend((uint8_t*) buf, strlen(buf));
    }
  }
  
  // Transmit errors over UART
  uint32_t error_iter;
  for(error_iter = 0; error_iter < current_error; error_iter++){
    sprintf(buf,"Error: %llx\n\r", error_buffer[error_iter]);
    UARTSend((uint8_t*) buf, strlen(buf));
  }
  current_error = 0;
  
#else
  
  uint32_t error_iter;
  unsigned char data1;
  unsigned char data2;
  unsigned char data3;
  for(error_iter = 0; error_iter < current_error; error_iter++){
    
    while(UARTBusy(UART_PRIMARY)){
    }
    
    // Transmit the 3 byte data header, 0b10000000/0x80
    UARTCharPut(UART_PRIMARY, 0x80);
    UARTCharPut(UART_PRIMARY, 0x80);
    UARTCharPut(UART_PRIMARY, 0x80);
    
    // Putting data into uchars for transmission
    data1 = error_buffer[error_iter] & 0xFF;
    data2 = (error_buffer[error_iter]>>8) & 0xFF;
    data3 = (error_buffer[error_iter]>>16) & 0xFF;
    
    // Transmit data
    UARTCharPut(UART_PRIMARY, data3);
    UARTCharPut(UART_PRIMARY, data2);
    UARTCharPut(UART_PRIMARY, data1);
    
  }
  current_error = 0;
#endif
  
}

//*****************************************************************************
//
// Create the health data integer and transmit it over UART.
//
//*****************************************************************************
void
TransmitHealth() {
  
  uint64_t health_data;
  
  //Heath_data is a mask
  health_data = (((uint64_t)HEALTH_DATA_HEADER_VALUE & HEALTH_DATA_HEADER_MASK) << HEALTH_DATA_HEADER_SHIFT) |
    (((uint64_t)cycle_count & HEALTH_DATA_CYCLE_MASK) << HEALTH_DATA_CYCLE_SHIFT) |
      (((uint64_t)chip_unresponsive & HEALTH_DATA_RESPONSIVENESS_MASK) << HEALTH_DATA_RESPONSIVENESS_SHIFT) |
        (((uint64_t)current_sequence_start & HEALTH_DATA_START_MASK) << HEALTH_DATA_START_SHIFT) |
          (((uint64_t)current_sequence_offset & HEALTH_DATA_OFFSET_MASK) << HEALTH_DATA_OFFSET_SHIFT);
  
#ifdef DEBUG
  
  char buf[100];
  sprintf(buf, "Health Data: %llx", health_data);
  UARTSend((uint8_t*) buf, strlen(buf));
  
#else
  
  unsigned char data0;
  unsigned char data1;
  unsigned char data2;
  unsigned char data3;     
  unsigned char data4;
  unsigned char data5;
  unsigned char data6;
  unsigned char data7;
  
  // Putting data into uchars for transmission
  data0 = health_data & 0xFF;
  data1 = (health_data>>8) & 0xFF;
  data2 = (health_data>>16) & 0xFF;
  data3 = (health_data>>24) & 0xFF;
  data4 = (health_data>>32) & 0xFF;
  data5 = (health_data>>40) & 0xFF;
  data6 = (health_data>>48) & 0xFF;
  data7 = (health_data>>54) & 0xFF;
  
  // Transmit data
  UARTCharPut(UART_PRIMARY, data7);
  UARTCharPut(UART_PRIMARY, data6);
  UARTCharPut(UART_PRIMARY, data5);
  UARTCharPut(UART_PRIMARY, data4);
  UARTCharPut(UART_PRIMARY, data3);
  UARTCharPut(UART_PRIMARY, data2);
  UARTCharPut(UART_PRIMARY, data1);
  UARTCharPut(UART_PRIMARY, data0);
  
#endif
  
}

#ifdef DEBUG

//*****************************************************************************
//
// Send a string to the UART.
//
//*****************************************************************************
void
UARTSend(const uint8_t *pui8Buffer, uint32_t ui32Count)
{
  //
  // Loop while there are more characters to send.
  //
  while(ui32Count--)
  {
    //
    // Write the next character to the UART.
    //
    UARTCharPut(UART_PRIMARY, *pui8Buffer++);
  }
}

//*****************************************************************************
//
// Print the current menu configuration.
//
//*****************************************************************************
void
print_menu(void)
{
  
