ERAU-EagleSat-PR/MDE/MDE_Payload_TM4C123GXL/MDE_Payload_TM4C123GXL.c
  char buf[200];
  
  switch (menu_state) 
  {
  case INIT:
    UARTCharPut(UART_PRIMARY, 0xC);
    sprintf(buf,"MDE Payload Prototype Interface\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    break;
  case MAIN:
    UARTCharPut(UART_PRIMARY, 0xC);
    sprintf(buf,"Menu Selection:\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"M - Return to this menu.\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"P - Print the current error buffer and reset it.\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"I - Enter Auto mode.\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"H - Print health data.\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"1 through 8 - Select the chip to interact with. Currently selected: %i\n\r", selected_chip_number);
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"All commands are listed are in order of Flash, FRAM, MRAM, SRAM.\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"W, E, R, T - send sequence to a chip.\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"S, D, F, G - get sequence from a chip.\n\r\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"Current Clock Speed: %d\n\r", SysClkSpeed);
    UARTSend((uint8_t*) buf, strlen(buf));
    sprintf(buf,"Current sequence parameters:\n\rStart: %i, Offset: %i\n\r\n\r", sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
    UARTSend((uint8_t*) buf, strlen(buf));
    break;
  case AUTO:
    sprintf(buf,"AUTO MODE. Hit M to exit.\n\r");
    UARTSend((uint8_t*) buf, strlen(buf));
    break;
  default:
    UARTCharPut(UART_PRIMARY, 0xC);
    sprintf(buf,"State failure!");
    
  }
}

//*****************************************************************************
//
// Process changes to the menu.
//
//*****************************************************************************
void
process_menu(int32_t recv_char)
{
  
  char buf[200];
  
  switch (menu_state)
  {
  case MAIN:
    switch (recv_char)
    {
    case 'm':
      menu_state = MAIN;
      break;
    case 'p':
      TransmitErrors();
      break;
    case 'i':
      menu_state = AUTO;
      UARTCharPut(UART_PRIMARY, 0xC);
      break;
    case 'h':
      TransmitHealth();
      break;
    case '1':
      selected_chip_number = 0;
      break;
    case '2':
      selected_chip_number = 1;
      break;
    case '3':
      selected_chip_number = 2;
      break;
    case '4':
      selected_chip_number = 3;
      break;
    case '5':
      selected_chip_number = 4;
      break;
    case '6':
      selected_chip_number = 5;
      break;
    case '7':
      selected_chip_number = 6;
      break;
    case '8':
      selected_chip_number = 7;
      break;
    case 'w':
      sprintf(buf,"Attempting to send data to Flash (chip %i)...\n\r", selected_chip_number + 8);
      UARTSend((uint8_t*) buf, strlen(buf));
      WriteToChip(selected_chip_number + 8, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break;
    case 'e':
      sprintf(buf,"Attempting to send data to FRAM (chip %i)...\n\r", selected_chip_number + 16);
      UARTSend((uint8_t*) buf, strlen(buf));
      WriteToChip(selected_chip_number + 16, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break;
    case 'r':
      sprintf(buf,"Attempting to send data to MRAM (chip %i)...\n\r", selected_chip_number + 24);
      UARTSend((uint8_t*) buf, strlen(buf));
      WriteToChip(selected_chip_number + 24, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break; 
    case 't':
      sprintf(buf,"Attempting to send data to SRAM (chip %i)...\n\r", selected_chip_number + 32);
      UARTSend((uint8_t*) buf, strlen(buf));
      WriteToChip(selected_chip_number + 32, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break; 
    case 's':
      sprintf(buf,"Attempting to read data from Flash (chip %i)...\n\r", selected_chip_number);
      UARTSend((uint8_t*) buf, strlen(buf));
      ReadFromChip(selected_chip_number + 8, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break;
    case 'd':
      sprintf(buf,"Attempting to read data from FRAM (chip %i)...\n\r", selected_chip_number);
      UARTSend((uint8_t*) buf, strlen(buf));
      ReadFromChip(selected_chip_number + 16, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break;
    case 'f':
      sprintf(buf,"Attempting to read data from MRAM (chip %i)...\n\r", selected_chip_number);
      UARTSend((uint8_t*) buf, strlen(buf));
      ReadFromChip(selected_chip_number + 24, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break;
    case 'g':
      sprintf(buf,"Attempting to read data from SRAM (chip %i)...\n\r", selected_chip_number);
      UARTSend((uint8_t*) buf, strlen(buf));
      ReadFromChip(selected_chip_number + 32, sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      break;
    }
    break;
  case AUTO:
    switch (recv_char)
    {
    case 'm':
      menu_state = MAIN;
      break;
    }
    break;
  }
}

#else

void
process_command(int32_t recv_char)
{
  
  switch (recv_char)
  {
  case 0x53: // transmit health data
    TransmitHealth();
    break;
  }
}
#endif

#ifdef ENABLE_UART0
//*****************************************************************************
//
// The UART0 interrupt handler.
//
//*****************************************************************************
void
UART0IntHandler(void)
{
  uint32_t ui32Status;
  
  //
  // Get the interrrupt status.
  //
  ui32Status = UARTIntStatus(UART0_BASE, true);
  
  //
  // Clear the asserted interrupts.
  //
  UARTIntClear(UART0_BASE, ui32Status);
  
  //
  // Loop while there are unsigned characters in the receive FIFO.
  //
  while(UARTCharsAvail(UART0_BASE))
  {
    
