ERAU-EagleSat-PR/MDE/MDE_Payload_TM4C123GXL/MDE_Payload_TM4C123GXL.c
    int32_t local_char;
    local_char = UARTCharGet(UART0_BASE);
    if(local_char != -1)
    {
#ifdef DEBUG
      process_menu(local_char);
#else
      process_command(local_char);
#endif
    }
#ifdef DEBUG
    print_menu();
#endif
  }
}
#endif

#ifdef ENABLE_UART2
//*****************************************************************************
//
// The UART2 interrupt handler.
//
//*****************************************************************************
void
UART2IntHandler(void)
{
  uint32_t ui32Status;
  
  //
  // Get the interrrupt status.
  //
  ui32Status = UARTIntStatus(UART2_BASE, true);
  
  //
  // Clear the asserted interrupts.
  //
  UARTIntClear(UART2_BASE, ui32Status);
  
  //
  // Loop while there are unsigned characters in the receive FIFO.
  //
  while(UARTCharsAvail(UART2_BASE))
  {
    
    int32_t local_char;
    local_char = UARTCharGet(UART2_BASE);
    if(local_char != -1)
    {
      process_command(local_char);
    }
  }
}
#endif

//*****************************************************************************
//
// The interrupt handler for the timer interrupt.
//
//*****************************************************************************
void
Timer0IntHandler(void)
{
  
  //
  // Clear the timer interrupt.
  //
  TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
  
  // Move onto the next cycle and trigger the timer if it's time to
  timer_current_cycle++;
  if(timer_current_cycle >= TIMER_CYCLES){
    timer_current_cycle = 0;
    timer_wakeup = true;
  }
  
  
  
}

//*****************************************************************************
//
// This is a prototype of the MDE
//
//*****************************************************************************
int
main(void)
{
  //
  // Enable lazy stacking for interrupt handlers.  This allows floating-point
  // instructions to be used within interrupt handlers, but at the expense of
  // extra stack usage.
  //
  FPUEnable();
  FPULazyStackingEnable();
  
  //
  // Set the clock speed.
  //
  SysClkSpeed = SysCtlClockFreqSet(SYSCTL_OSC_INT | SYSCTL_USE_PLL | SYSCTL_CFG_VCO_320, SYS_CLK_SPEED);
  
  //
  // Enable processor interrupts.
  //
  IntMasterEnable();
  
  ///////////////////////
  // Begin UART Config //
  /////////////////////// 
  
#ifdef ENABLE_UART0
  SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
  
  //
  // Check if the peripheral access is enabled.
  //
  while(!SysCtlPeripheralReady(SYSCTL_PERIPH_UART0) || 
        !SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOA))
  {
  }
  
  //
  // Set GPIO A0 and A1 as UART pins.
  //
  GPIOPinConfigure(GPIO_PA0_U0RX);
  GPIOPinConfigure(GPIO_PA1_U0TX);
  GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
  
  //
  // Configure the UART for 115,200, 8-N-1 operation.
  //
  UARTConfigSetExpClk(UART0_BASE, SysClkSpeed, BAUD_RATE,
                      (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                       UART_CONFIG_PAR_NONE));
  
  //
  // Enable the UART interrupt.
  //
  IntEnable(INT_UART0);
  UARTIntEnable(UART0_BASE, UART_INT_RX | UART_INT_RT);
  
  //
  // Clear the UART console
  //
  UARTCharPut(UART_PRIMARY, 0xC);
#endif
  
#ifdef ENABLE_UART2
  SysCtlPeripheralEnable(SYSCTL_PERIPH_UART2);
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
  
  //
  // Check if the peripheral access is enabled.
  //
  while(!SysCtlPeripheralReady(SYSCTL_PERIPH_UART2) ||
        !SysCtlPeripheralReady(SYSCTL_PERIPH_GPIOD))
  {
  }
  
  //
  // Unlock Port D for UART2
  //
  HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
  HWREG(GPIO_PORTD_BASE + GPIO_O_CR) |= 0x80;
  HWREG(GPIO_PORTD_BASE + GPIO_O_AFSEL) &= ~0x80;   
  HWREG(GPIO_PORTD_BASE + GPIO_O_DEN) |= 0x80;
  HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = 0;
  
  //
  // Set GPIO D6 and D7 as UART pins.
  //
  GPIOPinConfigure(GPIO_PD6_U2RX);
  GPIOPinConfigure(GPIO_PD7_U2TX);
  GPIOPinTypeUART(GPIO_PORTD_BASE, GPIO_PIN_6 | GPIO_PIN_7);
  
  //
  // Configure the UART for 115,200, 8-N-1 operation.
  //
  UARTConfigSetExpClk(UART2_BASE, SysClkSpeed, BAUD_RATE,
                      (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE |
                       UART_CONFIG_PAR_NONE));
  
  //
  // Enable the UART interrupt.
  //
  IntEnable(INT_UART2);
  UARTIntEnable(UART2_BASE, UART_INT_RX | UART_INT_RT);
#endif
  
  /////////////////////
  // End UART Config //
  /////////////////////
  
  /////////////////////////
  // Begin IO Pin Config //
  /////////////////////////
  
  //
  // Enable N-PORT GPIO, SPI port, and chip ports
  //
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
  SysCtlPeripheralEnable(SPI_SYS_PORT);
  SysCtlPeripheralEnable(SPI_SYS_DAT_PORT);
  
  //
  // Check if the peripheral access is enabled.
  //
  while(!SysCtlPeripheralReady(SYSCTL_PERIPH_GPION) ||
        !SysCtlPeripheralReady(SPI_SYS_PORT) ||
        !SysCtlPeripheralReady(SPI_SYS_DAT_PORT))
  {
  }
  
  //
  // Enable all the chip selects
  //
  EnableChipSelects();
  
  //
  // Enable the SPI interface
  //
  SysCtlPeripheralEnable(SPI_SYS_PERIPH);
  
  while(!SysCtlPeripheralReady(SPI_SYS_PERIPH))
  {
  }
  
  //
  // Configure SPI pins
  //
  GPIOPinConfigure(SPI_CLK);
  GPIOPinConfigure(SPI_MOSI);
  GPIOPinConfigure(SPI_MISO);
  GPIOPinTypeSSI(SPI_PORT, SPI_CLK_NUM | SPI_MOSI_NUM | SPI_MISO_NUM);
  
  GPIOPinConfigure(SPI_DAT2);
  GPIOPinConfigure(SPI_DAT3);
  GPIOPinTypeSSI(SPI_DAT_PORT, SPI_DAT2_NUM | SPI_DAT3_NUM);
  
  //
  // Configure SPI interface
  //
  SSIDisable(SPI_NUM_BASE);
  SSIConfigSetExpClk(SPI_NUM_BASE, SysClkSpeed, SSI_FRF_MOTO_MODE_0, SSI_MODE_MASTER, SPI_CLK_SPEED, 8);
  SSIEnable(SPI_NUM_BASE);
  
  //
  // Clear out the FIFO
  //
  uint32_t temp;
  while(SSIDataGetNonBlocking(SPI_NUM_BASE, &temp))
  {
  }
  
  //
  // Configure Memory Registers
  //
  /* IS THIS ALL SUPPOSED TO BE COMMENTED?
  
  //
  // Removing Flash write restrictions
  //
  
  // Drop CS line
  GPIOPinWrite(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN, 0x0);
  while(GPIOPinRead(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN))
  {
}
  
  // Transmit enable write status register instruction
  SSIDataPut(SPI_NUM_BASE, FLASH_EWSR);
  while(SSIBusy(SPI_NUM_BASE))
  {
}
  
