ERAU-EagleSat-PR/MDE/MDE_Payload_TM4C123GXL/MDE_Payload_TM4C123GXL.c
  // Cycle CS line
  GPIOPinWrite(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN, FLASH_CHIP_SELECT_PIN);
  while(!GPIOPinRead(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN))
  {
}
  GPIOPinWrite(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN, 0x0);
  while(GPIOPinRead(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN))
  {
}
  
  // Write to the status register to remove the write restrictions
  SSIDataPut(SPI_NUM_BASE, FLASH_WRSR);
  SSIDataPut(SPI_NUM_BASE, 0x0);
  while(SSIBusy(SPI_NUM_BASE))
  {
}
  
  // Raise CS line
  GPIOPinWrite(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN, FLASH_CHIP_SELECT_PIN);
  while(!GPIOPinRead(FLASH_CHIP_SELECT_PORT, FLASH_CHIP_SELECT_PIN))
  {
}
  
  //
  // Removing MRAM write restrictions
  //
  
  // Drop CS line
  GPIOPinWrite(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN, 0x0);
  while(GPIOPinRead(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN))
  {
}
  
  // Enable writing to the register
  SSIDataPut(SPI_NUM_BASE, MRAM_WRITE_ENABLE);
  while(SSIBusy(SPI_NUM_BASE))
  {
}
  
  // Cycle the CS
  GPIOPinWrite(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN, MRAM_CHIP_SELECT_PIN);
  while(!GPIOPinRead(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN))
  {
}
  GPIOPinWrite(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN, 0x0);
  while(GPIOPinRead(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN))
  {
}
  
  // Write the code to remove write restrictions
  SSIDataPut(SPI_NUM_BASE, MRAM_WRSR);
  SSIDataPut(SPI_NUM_BASE, 0x02);
  while(SSIBusy(SPI_NUM_BASE))
  {
}
  
  // Cycle the CS
  GPIOPinWrite(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN, MRAM_CHIP_SELECT_PIN);
  while(!GPIOPinRead(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN))
  {
}
  GPIOPinWrite(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN, 0x0);
  while(GPIOPinRead(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN))
  {
}
  
  // Disable writing to the register
  SSIDataPut(SPI_NUM_BASE, MRAM_WRITE_DISABLE);
  while(SSIBusy(SPI_NUM_BASE))
  {
}
  
  // Raise CS line
  GPIOPinWrite(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN, MRAM_CHIP_SELECT_PIN);
  while(!GPIOPinRead(MRAM_CHIP_SELECT_PORT, MRAM_CHIP_SELECT_PIN))
  {
}
  
  //
  // SRAM to sequential mode
  //
  
  // Drop CS line
  GPIOPinWrite(SRAM_CHIP_SELECT_PORT, SRAM_CHIP_SELECT_PIN, 0x0);
  while(GPIOPinRead(SRAM_CHIP_SELECT_PORT, SRAM_CHIP_SELECT_PIN))
  {
}
  
  // Transmit instruction and code for sequential operation
  SSIDataPut(SPI_NUM_BASE, SRAM_WRMR);
  SSIDataPut(SPI_NUM_BASE, SRAM_SEQUENTIAL_CODE);
  while(SSIBusy(SPI_NUM_BASE))
  {
}
  
  // Bring CS high again
  GPIOPinWrite(SRAM_CHIP_SELECT_PORT, SRAM_CHIP_SELECT_PIN, SRAM_CHIP_SELECT_PIN);
  while(!GPIOPinRead(SRAM_CHIP_SELECT_PORT, SRAM_CHIP_SELECT_PIN))
  {
}
  */
  ///////////////////////
  // End IO Pin Config //
  ///////////////////////
  
  /////////////////////////////
  // Begin Sleep Mode Config //
  /////////////////////////////
  
  // Enable the peripherals that we need in sleep mode
#ifdef ENABLE_UART0
  SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_UART0);
#endif
#ifdef ENABLE_UART2
  SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_UART2);
#endif
  SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_TIMER0);
  
  // Set power mode
  SysCtlSleepPowerSet(SYSCTL_FLASH_NORMAL | SYSCTL_SRAM_NORMAL);
  
  // Set clock gating to false
  // This may have to be changed later
  SysCtlPeripheralClockGating(false);
  
  ///////////////////////////
  // End Sleep Mode Config //
  ///////////////////////////
  
  ////////////////////////
  // Begin Timer Config //
  ////////////////////////
  
  //
  // Enable the timer peripheral
  //
  SysCtlPeripheralEnable(SYSCTL_PERIPH_TIMER0);
  
  //
  // Configure a 32bit periodic timer.
  //
  TimerConfigure(TIMER0_BASE, TIMER_CFG_PERIODIC);
  TimerLoadSet(TIMER0_BASE, TIMER_A, SysClkSpeed * MEMORY_CYCLE_TIME);
  
  //
  // Setup the interrupts for the timer timeouts.
  //
  IntEnable(INT_TIMER0A);
  TimerIntEnable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
  
  //
  // Enable the timers.
  //
  TimerEnable(TIMER0_BASE, TIMER_A);
  
  //////////////////////
  // End Timer Config //
  //////////////////////
  
  // Wait a bit and flash some lights
  GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_0);
  GPIOPinTypeGPIOOutput(GPIO_PORTN_BASE, GPIO_PIN_1);
  
  GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_PIN_0);
  GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_PIN_1);
  SysCtlDelay(SysClkSpeed * 1/3);
  GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0x0);
  GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0x0);
  
#ifdef DEBUG
  // Send out menu splash.
  print_menu();
#endif
  
  GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_PIN_0);
  /*FlashSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset], SysClkSpeed);
  FRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
  MRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
  SRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);*/
  GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0x0);
  
#ifdef DEBUG
  // Change Menu State
  menu_state = MAIN;
  print_menu();
#endif
  
  //
  // Loop forever triggering payload activity every timeperiod.
  //
  while(1)
  {
    
    SysCtlSleep();
    
#ifdef DEBUG
    
    char buf[80];
    
    // Auto mode handling
    if(menu_state == AUTO && timer_wakeup){
      timer_wakeup = false;
      sprintf(buf,"Timer wakeup. Checking for errors...\n\r");
      UARTSend((uint8_t*) buf, strlen(buf));
      
      // Read the old data
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_PIN_0);
      /*FlashSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      FRAMSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      MRAMSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      SRAMSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);*/
      TransmitHealth();
      TransmitErrors();
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0x0);
      
      // Increment the sequence
      current_sequence_start++;
      current_sequence_offset++;
      cycle_count++;
      if(current_sequence_start >= SEQUENCE_START_VALUES_LENGTH){
        current_sequence_start = 0;
      }
      if(current_sequence_offset >= SEQUENCE_OFFSET_VALUES_LENGTH){
        current_sequence_offset = 0;
      }
      
      // Transmit new data
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_PIN_1);
      /*FlashSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset], SysClkSpeed);
      FRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      MRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      SRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);*/
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0x0);
      
      sprintf(buf,"Sequence written, beginning next cycle.\n\r");
      UARTSend((uint8_t*) buf, strlen(buf));
    }
#else
    // Basically auto mode but for flight config
    // Might want to add another condition here to wait for a command before
    // starting or something
    if(timer_wakeup){
      timer_wakeup = false;
      
      // Read the old data
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_PIN_0);
      /*FlashSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      FRAMSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      MRAMSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      SRAMSequenceRetrieve(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);*/
      TransmitErrors();
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_0, 0x0);
      
      // Increment the sequence
      current_sequence_start++;
      current_sequence_offset++;
      cycle_count++;
      if(current_sequence_start >= SEQUENCE_START_VALUES_LENGTH){
        current_sequence_start = 0;
      }
      if(current_sequence_offset >= SEQUENCE_OFFSET_VALUES_LENGTH){
        current_sequence_offset = 0;
      }
      
      // Transmit new data
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_PIN_1);
      /*FlashSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset], SysClkSpeed);
      FRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      MRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);
      SRAMSequenceTransmit(sequence_start_values[current_sequence_start], sequence_offset_values[current_sequence_offset]);*/
      GPIOPinWrite(GPIO_PORTN_BASE, GPIO_PIN_1, 0x0);
      
    }
#endif
  }
}
